{
  "profile": {
    "work_experience": [
      {
        "company": "Allpay Ltd.",
        "title": "Mobile App Project Manager",
        "start_date": "Feb 2025",
        "end_date": "Present",
        "description": [
          "Managed a team of offshore and onshore developers to develop and launch a new payments mobile app.",
          "Coordinated the integration of 20+ suppliers including fraud detection, open banking, transaction handling and service providers.",
          "Led the development of internal integration standards including the deployment of APIs used by our 3rd party developers.",
          "Coordinated multiple disciplines including Testing, UX/UI, Product and Compliance to develop and enhance an MVP concept.",
          "Worked within ITIL Service management framework to deliver a robust consumer experience."
        ]
      },
      {
        "company": "Transport for London",
        "title": "Digital Channels & Payments Delivery Lead",
        "start_date": "Jun 2023",
        "end_date": "Feb 2025",
        "description": [
          "Led the development and implementation of integration standards for a road user charging platform on Azure Stack, utilizing Azure Integration Services (AIS) to connect apps, data, and services across cloud and on-premises environments.",
          "Published an interface specification for third-party debt recovery agencies to ensure seamless data exchange and compliance.",
          "Developed and deployed a single sign-on platform that integrated Oyster and TfL systems, enhancing user experience and security.",
          "Introduced direct debit capability and integrated a payments platform with the road user charging system, ensuring robust and secure transaction processing."
        ]
      },
      {
        "company": "UKHSA",
        "title": "Integration Delivery Lead",
        "start_date": "Jan 2021",
        "end_date": "Dec 2022",
        "description": [
          "Owned the integration development and operations pipeline utilising Mulesoft, VBA, Power Apps, Power BI and a host of technology capabilities.",
          "Transitioned from supply chain capability based on Power Apps and Excel to robust strategic alternatives.",
          "Designed and deployed Interface standards for 100+ partners and suppliers, using API and file based integrations, to co-ordinate supply chain activities within UKHSA."
        ]
      },
      {
        "company": "Transport for Wales Rail Services",
        "title": "Digital Project Manager",
        "start_date": "Mar 2020",
        "end_date": "Dec 2020",
        "description": [
          "Delivered a data lake capability integrating data from across the TfW estate with new data from 20+ sources including sourcing, cleansing and revalidating the data.",
          "Digital project management focusing on web, mobile, software and cloud delivery in agile framework."
        ]
      },
      {
        "company": "Npower Digital",
        "title": "Delivery Manager/Project Manager",
        "start_date": "Jul 2017",
        "end_date": "Mar 2019",
        "description": [
          "Led programme delivery of complex technical solutions involving multiple integrating parties, managing migration of mobile middleware platform to AWS cloud provision with seamless API integration touchpoints.",
          "Managed third party developers and solution vendors, analysing technical integration requirements and resolving issues during complex deployment projects."
        ]
      },
      {
        "company": "B60 Mobile Consultancy and Mobile Digital Agency",
        "title": "Mobile Delivery Consultant",
        "start_date": "Apr 2017",
        "end_date": "Jun 2017",
        "description": [
          "Managing a team of developers, project managers and UX experts to deliver a range of digital products.",
          "Backlog grooming ensuring that items placed on the backlog are clearly defined and meet the definition of ready."
        ]
      },
      {
        "company": "C3UK",
        "title": "Project Director",
        "start_date": "Mar 2016",
        "end_date": "Mar 2017",
        "description": [
          "Managed the development of a transport App as part of a Government funded innovation programme involving multiple parties, including universities and a Telecoms Provider.",
          "Agile practice instantiation moving the business first to sprint deliveries fortnightly and later to weekly sprints."
        ]
      },
      {
        "company": "National Grid",
        "title": "Project Manager",
        "start_date": "Jan 2015",
        "end_date": "Mar 2016",
        "description": [
          "Delivery of Mobile applications in SAP Mobile platform landscape.",
          "Introduction of Agile methods for project delivery including agile toolset, methodology and training for team members."
        ]
      },
      {
        "company": "Royal Bank of Scotland",
        "title": "Programme/Project Manager",
        "start_date": "Apr 2013",
        "end_date": "Dec 2014",
        "description": [
          "Agile Project Management and Delivery of multiple RBS Mobile Apps including regulatory and containerised applications.",
          "Managing the delivery of multiple initiatives within RBS’s digital colleague mobile programme."
        ]
      },
      {
        "company": "First Group – UK Rail Division",
        "title": "Project Manager/Delivery Manager",
        "start_date": "Oct 2010",
        "end_date": "Feb 2013",
        "description": [
          "Fulfilling a number of roles including the management of the mobile applications factory, writing IT strategy for Digital customer engagement, cost modeling for franchise bidding and Product research.",
          "Established Agile project management practices for the delivery of First Groups digital portfolio."
        ]
      }
    ],
    "education": [
      {
        "institution": "Manchester Metropolitan University",
        "degree": "BEng (Hons)",
        "field": "Electronic and Electrical Engineering",
        "start_date": "1993",
        "end_date": "1997"
      },
      {
        "institution": "University of London",
        "degree": "MSc",
        "field": "Project Management",
        "start_date": "1998",
        "end_date": "1999"
      },
      {
        "institution": "Open University",
        "degree": "Diploma",
        "field": "Business Administration",
        "start_date": "2000",
        "end_date": "2001"
      },
      {
        "institution": "Imperial College London",
        "degree": "Certificate",
        "field": "Data Science",
        "start_date": "2018",
        "end_date": "2019"
      },
      {
        "institution": "Harvard Business School",
        "degree": "Executive Education",
        "field": "Leadership",
        "start_date": "2022",
        "end_date": "2022"
      }
    ],
    "skills": [
      { "skill": "Industry Solutions" },
      { "skill": "IT Strategy" },
      { "skill": "Project Management" },
      { "skill": "Agile Methodologies" },
      { "skill": "Team Leadership" },
      { "skill": "Process Improvement" },
      { "skill": "Stakeholder Management" },
      { "skill": "Digital Transformation" },
      { "skill": "API Integration" },
      { "skill": "Cloud Computing" },
      { "skill": "ServiceNow" },
      { "skill": "Azure" },
      { "skill": "AWS" },
      { "skill": "Mulesoft" },
      { "skill": "Power BI" },
      { "skill": "VBA" },
      { "skill": "Mobile App Development" },
      { "skill": "Vendor Management" },
      { "skill": "Business Analysis" },
      { "skill": "Change Management" },
      { "skill": "Risk Management" },
      { "skill": "Scrum" },
      { "skill": "Kanban" },
      { "skill": "Jira" },
      { "skill": "Confluence" }
    ]
  },
  "job_description": "Technology Support Manager (ServiceNow) - Contract\nLocation: Leeds (Wellington Place) or Edinburgh - Hybrid (2 days in office)\nContract Length: 6 months (potential for extension)\nDay Rate: 625 per day via Umbrella or EC\n\nAbout Client: You'll be joining a leading UK financial services organisation that is investing heavily in technology, people, and innovation. The team is driving large-scale digital transformation to deliver better outcomes for millions of customers.\n\nAbout the Role\n\nWe are looking for a Technology Support Manager with strong ServiceNow expertise to join a Service Transformation Lab focused on shaping how colleagues interact with IT. This role is pivotal in designing and delivering innovative solutions that enhance digital engagement, working closely with developers, analysts, and architects across all ServiceNow modules.\n\nYou'll be working in a highly collaborative, Agile environment, leading the creation of enterprise-level solutions that drive platform capability and long-term value.\n\nWhat You'll Be Doing\n\nInterpreting user stories and supporting development through to completion\nImplementing new functionality and solutions in ServiceNow\nCollaborating with developers, analysts, architects, and external UI experts\nDriving platform innovation across ITSM, Employee Centre, Cyber, Change, and Payments\nWhat We're Looking For\n\nTo be considered, your CV should demonstrate:\n\nA proven track record at a senior level within ServiceNow development\nExperience working in an Agile engineering environment\nBroad knowledge of ServiceNow modules and how they interact\nExpertise in process/solution integration and workflow design (including Event Flow Handler)\nStrong technical grasp of API, JSON, MID Servers and associated integration technologies\nHands-on experience in ServiceNow implementations\nPersonal Qualities\n\nWe're seeking someone who is:\n\nDecisive, creative, and analytical with a proactive mindset\nA strong communicator with excellent relationship management skills\nWell organised, pragmatic, and able to manage multiple priorities in a fast-paced setting\nA true team player who thrives in a collaborative environment\nWhy Join?\n\nThis is an opportunity to work at the forefront of ServiceNow innovation, delivering meaningful solutions that transform digital engagement at scale. You'll be part of a forward-thinking team that embraces diversity, inclusivity, and continuous learning.\n\nPlease be advised if you haven't heard from us within 48 hours then unfortunately your application has not been successful on this occasion, we may however keep your details on file for any suitable future vacancies and contact you accordingly.\n\nPontoon/Adecco is an employment consultancy. We put expertise, energy, and enthusiasm into improving everyone's chance of being part of the workplace. We respect and appreciate people of all ethnicities, generations, religious beliefs, sexual orientations, gender identities, and more. We do this by showcasing their talents, skills, and unique experience in an inclusive environment that helps them thrive.\n\nLocationCity, Leeds, UK\nIndustryIT\nRate500.00 Daily - 625.00 Daily GBP\nEmployment BusinessPontoon\nContactPontoon\nReferenceJS2998386007\nPosted Date18/09/2025 19:49:20\nPermalinkhttp://www.jobserve.com/eOKBy\n\nAdditional Responsibilities:\n- Lead cross-functional teams in the delivery of ServiceNow solutions.\n- Mentor junior staff and provide technical guidance.\n- Oversee the integration of new modules and ensure best practices are followed.\n- Report to senior management on project progress and outcomes.\n- Ensure compliance with all relevant regulations and standards.\n- Participate in strategic planning and roadmap development.\n- Foster a culture of innovation and continuous improvement.\n- Manage budgets and resource allocation for IT projects.\n- Liaise with external vendors and partners.\n- Represent the company at industry events and conferences.\n- Develop and deliver training sessions for end users.\n- Analyze data and metrics to drive decision-making.\n- Support business development activities as needed.\n- Maintain up-to-date knowledge of industry trends and emerging technologies.\n- Ensure robust documentation and knowledge transfer.\n- Handle escalations and resolve complex technical issues.\n- Drive adoption of new tools and processes.\n- Champion diversity and inclusion within the team.\n- Contribute to the company's thought leadership initiatives.\n- Support the recruitment and onboarding of new team members.\n"
}
